app/controllers/api/v1/gps_controller.rb

  def index
    render json: Vehicle.all.map { |v| { id: v.id, lat: v.latitude, lng: v.longitude } }
---
SELECT "vehicles".* FROM "vehicles"