app/views/batches/index.html.erb

      <p class="text-gray-700 mb-6">
        <%= pluralize(Vehicle.where(status: 'online').count, "truck") %> online
---
SELECT COUNT(*) FROM "vehicles" WHERE "vehicles"."status" = 'online'