app/controllers/batches_controller.rb

  def coc_pdf
    @batch = Batch.find(params[:id])
---
SELECT "batches".* FROM "batches" WHERE "batches"."id" = 1 LIMIT 1