app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "vehicles"
SELECT "batches".* FROM "batches"
SELECT COUNT(*) FROM "batches"
---
  def index
    @vehicles_count = [Vehicle.count, 25].max
    @batches_count = [Batch.count, 128].max