app/controllers/health_controller.rb

SELECT COUNT(*) FROM "batches"
SELECT COUNT(*) FROM "vehicles"
---
  def show
    render plain: "OK - #{Vehicle.count} vehicles, #{Batch.count} batches"